---
title: 独立功能的实现
category: Redis
typora-root-url: ../../
---

 # 发布与订阅

服务器中维护着一个pubsub_channels字典，所有的频道和订阅关系都存储在这里。字典的键为频道的名称，而值为订阅频道的客户端链表。

1. 当有新的客户端订阅某个频道时，会发生两种情况中的一种：
   1. 如果频道已经存在，则新的客户端会添加到pubsub_channels对应频道的链表末尾
   2. 如果频道原本不存在，则会为频道创建一个键，该客户端成为链表的第一个元素

2. 当一个客户端退订一个频道的时候：

   pubsub_channels对应键的链表会删除该客户端

3. 发送信息

服务器会遍历pubsub_channels中对应键的链表，向每一个客户端发送信息

![图片描述](/assets/img/bVUwcA)

命令：

订阅频道 

```redis
SUSCRIBE channel1 [channel2]
```

客户端一旦与某个频道建立连接就不能进行其他操作，一旦客户端退出连接，订阅的频道自动会断开。



订阅模式

```redis
PSUBSCRIBE pattern1 [pattern2]
```

pattern 可以用*进行模糊匹配

例如订阅cctv.* 



发布消息

```redis
PUBLISH channel message
```

向一个频道发送消息，所有订阅这个频道的客户端都会接收到消息



查看已有的频道



# 事务

```redis
> MULTI
OK
> SET "name" "lihenan"
QUEUED
> get "name"
QUEUED
> exec
1) OK
2) "lihenan"
```

通过MULTI开启事务，EXEC执行



## 事务的实现

步骤

1. 命令开始
2. 命令入队
3. 事务执行

### 命令开始

```
> MULTI
OK
```

MULTI命令可以将执行该命令的客户端从非事务状态切换至事务状态

通过在客户端状态的flags属性中打开 REDIS_MULTI 标识来完成的

### 命令入队

当一个客户端在事务状态

- 如果发送 `EXE  \  DISCARD  \ WATCH \ MULTI` 命令 ，服务器会立即执行
- 其他命令不会立即执行，会放入一个事务队列，然后向客户端返回 `QUEUED`

```redis
> MULTI
OK
> SET "name" "lihenan"
QUEUED
> get "name"
QUEUED
> exec
1) OK
2) "lihenan"
```

### 执行事务

发送EXEC

返回执行结果

```
> exec
1) OK
2) "lihenan"
```



注意：

1. 如果执行的命令有语法错误，直接返回，服务器拒绝执行所有命令
2. 如果错误是执行前无法发现的，那么那天命令返回失败，其他剩下的命令正常执行

## WATCH命令的实现

WATCH 命令是乐观锁

它可以在EXEC命令执行之前，监视任意数量的数据库键，并在EXEC命令执行时，检查被监视的键是否至少有一个已经被修改过

- 是的话，服务器将拒绝执行事务，并向客户端返回代表事务执行失败的空回复（nil）

注意：

由于WATCH命令的作用只是当被监控的键值被修改后阻止之后一个事务的执行，而不能保证其他客户端不修改这一键值，所以在一般的情况下我们需要在EXEC执行失败后重新执行整个函数。



> 作者说，redis的事务具有ACID
>
> 可以说支持原子性吧，只是不支持回滚



## 二进制位数组

**底层是用SDS实现的，使用逆序来保存位数组，这样SETBIT命令需要进行空间扩展时，不用移动现有二进制位**

bit = ( offset mod 8) + 1



处理二进制位数组，又称位数组命令

SETBIT 、 GETBIT  、 BITCOUNT 、 BITTOP

```redis
> setbit bit 0 1
0
> setbit bit 3 1
0
> getbit bit 0
1
> getbit bit 1
0
> getbit bit 3
1
> bitcount bit
2
```

SETBIT 给位数组指定偏移量上的二进制位设置值，偏移量从0开始计数，值可以设置为0或者1  ，时间复杂度O(1)

GETBIT 获取指定偏移量上的二进制位的值，时间复杂度O(1)

BITCOUNT 统计数组内值位1的二进制位的数量 ， 查表法和 variable-precisionSWAR算法 ，时间复杂度O(N)

BITOP http://doc.redisfans.com/string/bitop.html，时间复杂度O(1)

> 对一个或多个保存二进制位的字符串 `key` 进行位元操作，并将结果保存到 `destkey` 上。
>
> `operation` 可以是 `AND` 、 `OR` 、 `NOT` 、 `XOR` 这四种操作中的任意一种：
>
> - `BITOP AND destkey key [key ...]` ，对一个或多个 `key` 求逻辑并，并将结果保存到 `destkey` 。
> - `BITOP OR destkey key [key ...]` ，对一个或多个 `key` 求逻辑或，并将结果保存到 `destkey` 。
> - `BITOP XOR destkey key [key ...]` ，对一个或多个 `key` 求逻辑异或，并将结果保存到 `destkey` 。
> - `BITOP NOT destkey key` ，对给定 `key` 求逻辑非，并将结果保存到 `destkey` 。
>
> 除了 `NOT` 操作之外，其他操作都可以接受一个或多个 `key` 作为输入。



## 慢查询日志

Redis的慢查询日志功能用于记录执行时间超过给定时长的命令请求，用户可以通过这个功能产生的日志来监视和优化查询速度

```
执行超过多少微秒的命令请求会被记录在日志上
slowlog-log-slower-than

服务器最多保存多少条慢查询日志，达到后插入新一条，就删除一条旧的
slowlog-max-len

查看服务器锁保存的慢查询日志
SHOWLOG GET

```



## 监视器

通过执行MONITOR 命令，客户端可以将自己变为一个监视器，实时地接收并打印出服务器当前处理的命令请求的相关信息